In [1]:
# Import our dependencies
import pandas as pd

import matplotlib.pyplot as plt

#  Import and read the cardio_train.csv.

trial_df = pd.read_csv("../cardio_train.csv", sep=";")
trial_df.head()

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
0,0,18393,2,168,62.0,110,80,1,1,0,0,1,0
1,1,20228,1,156,85.0,140,90,3,1,0,0,1,1
2,2,18857,1,165,64.0,130,70,3,1,0,0,0,1
3,3,17623,2,169,82.0,150,100,1,1,0,0,1,1
4,4,17474,1,156,56.0,100,60,1,1,0,0,0,0

In [2]:
#Check for duplicatess 
trial_df.duplicated(subset=['id']).value_counts()

False    70000
dtype: int64

In [3]:
sample_df = trial_df.sample(frac=0.05, random_state=1)
sample_df.head()

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
6670,9510,16099,1,153,93.0,140,90,1,1,0,0,1,1
49567,70773,14437,1,157,89.0,120,80,1,1,0,0,1,1
50796,72486,19839,1,165,66.0,150,90,1,1,0,0,1,1
22310,31877,18050,2,176,88.0,160,100,2,2,1,1,1,1
54037,77086,16819,2,165,78.0,140,90,1,1,0,0,0,1

In [4]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3500 entries, 6670 to 28616
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           3500 non-null   int64
 1   age          3500 non-null   int64
 2   gender       3500 non-null   int64
 3   height       3500 non-null   int64
 4   weight       3500 non-null   float64
 5   ap_hi        3500 non-null   int64
 6   ap_lo        3500 non-null   int64
 7   cholesterol  3500 non-null   int64
 8   gluc         3500 non-null   int64
 9   smoke        3500 non-null   int64
 10  alco         3500 non-null   int64
 11  active       3500 non-null   int64
 12  cardio       3500 non-null   int64
dtypes: float64(1), int64(12)
memory usage: 382.8 KB

In [5]:
sample_df.to_csv("sample.csv", index=False)

In [6]:
# Import module from sqlalchemy 
from sqlalchemy import create_engine
from config import db_password

In [7]:
# Create database engine 
# db_string = "postgres://[user]:[password]@[location]:[port]/[database]"
#      where [location] = AWS_RDS_end-point
db_string = f"postgresql://postgres:{db_password}@cardiovasculardb.ctyxqkz5om6e.us-east-1.rds.amazonaws.com:5432/"

engine = create_engine(db_string)

In [8]:
sample_df.head()

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,gluc,smoke,alco,active,cardio
6670,9510,16099,1,153,93.0,140,90,1,1,0,0,1,1
49567,70773,14437,1,157,89.0,120,80,1,1,0,0,1,1
50796,72486,19839,1,165,66.0,150,90,1,1,0,0,1,1
22310,31877,18050,2,176,88.0,160,100,2,2,1,1,1,1
54037,77086,16819,2,165,78.0,140,90,1,1,0,0,0,1

### Import cardio data to postgreSQL tables

In [9]:
db_string = f"postgresql://postgres:{db_password}@cardiovasculardb.ctyxqkz5om6e.us-east-1.rds.amazonaws.com:5432/heart_train"

engine = create_engine(db_string)

In [10]:
# Import patient data
patient_data = sample_df[['id','age','gender','height','weight','cardio']]
patient_data = patient_data.set_index(['id'],drop='True')
patient_data

         age  gender  height  weight  cardio
id
9510   16099       1     153    93.0       1
70773  14437       1     157    89.0       1
72486  19839       1     165    66.0       1
31877  18050       2     176    88.0       1
77086  16819       2     165    78.0       1
...      ...     ...     ...     ...     ...
76013  20705       1     166    88.0       0
14864  19015       2     172    89.0       1
68882  18345       1     168    61.0       0
10070  20421       2     174    71.0       0
40915  21358       2     168    79.0       0

[3500 rows x 5 columns]

In [11]:
patient_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3500 entries, 9510 to 40915
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3500 non-null   int64
 1   gender  3500 non-null   int64
 2   height  3500 non-null   int64
 3   weight  3500 non-null   float64
 4   cardio  3500 non-null   int64
dtypes: float64(1), int64(4)
memory usage: 164.1 KB

In [12]:
# Save the patient_data to postgreSQL table
patient_data.to_sql(name='patient_table', con=engine, if_exists='replace')

In [13]:
# Import health factors data
health_factors_data= sample_df[["id","ap_hi", "ap_lo", "cholesterol", "gluc"]]
health_factors_data= health_factors_data.set_index(['id'],drop='True')
health_factors_data

       ap_hi  ap_lo  cholesterol  gluc
id
9510     140     90            1     1
70773    120     80            1     1
72486    150     90            1     1
31877    160    100            2     2
77086    140     90            1     1
...      ...    ...          ...   ...
76013    120     80            2     1
14864    110     70            1     2
68882    110     60            1     1
10070    120     80            1     1
40915    120     80            1     1

[3500 rows x 4 columns]

In [14]:
health_factors_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3500 entries, 9510 to 40915
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ap_hi        3500 non-null   int64
 1   ap_lo        3500 non-null   int64
 2   cholesterol  3500 non-null   int64
 3   gluc         3500 non-null   int64
dtypes: int64(4)
memory usage: 136.7 KB

In [15]:
# Save the health_factors data to postgreSQL table
health_factors_data.to_sql(name='health_factors_table', con=engine, if_exists='replace')

In [16]:
# Import lifestyle data
lifestyle_data = sample_df[["id","smoke","alco","active"]]
lifestyle_data = lifestyle_data.set_index(['id'],drop='True')
lifestyle_data

       smoke  alco  active
id
9510       0     0       1
70773      0     0       1
72486      0     0       1
31877      1     1       1
77086      0     0       0
...      ...   ...     ...
76013      0     0       1
14864      1     0       1
68882      0     0       1
10070      1     0       1
40915      1     0       1

[3500 rows x 3 columns]

In [17]:
lifestyle_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3500 entries, 9510 to 40915
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   smoke   3500 non-null   int64
 1   alco    3500 non-null   int64
 2   active  3500 non-null   int64
dtypes: int64(3)
memory usage: 109.4 KB

In [18]:
# Save the lifestyle data to postgreSQL table
lifestyle_data.to_sql(name='lifestyle_table', con=engine, if_exists='replace')